In [1]:
import pandas as pd

In [2]:
car_sales = pd.read_csv('car-sales.csv')
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [3]:
# typy danych w kolumnach
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [4]:
# nazwy kolumn
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [5]:
# opis indexowania wierszy: start od 0 do 10, z krokiem co 1
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [6]:
# dane statystyczne ale tylko na danych numerycznych, na stringach nie zrobi.
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [7]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [8]:
# nowa seria do testów
car_prices = pd.Series([3000, 1500, 111250])
car_prices

0      3000
1      1500
2    111250
dtype: int64

In [9]:
# średnia arytmetyczna
car_prices.mean()

38583.333333333336

In [10]:
# suma całej serii
car_prices.sum()

115750

In [11]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [12]:
# sumy wszystkich column, jeżeli wartość nie jest liczbowa, to sringi są łączone
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [13]:
# suma kolumny 'Doors'
car_sales['Doors'].sum()

40

In [14]:
# sama kolumna 'Doors'
car_sales['Doors']

0    4
1    4
2    3
3    5
4    4
5    4
6    4
7    4
8    4
9    4
Name: Doors, dtype: int64

In [15]:
# średnia
car_sales['Doors'].mean()

4.0

In [16]:
# ilość wierszy
len(car_sales)

10

## Indeksowanie

In [26]:
# automatyczne indeksowanie serii 
animals = pd.Series(['cat', 'dog', 'bird', 'panda', 'snake'])
animals

0      cat
1      dog
2     bird
3    panda
4    snake
dtype: object

In [28]:
# ręczne indeksowanie serii, nie koniecznie musi być pokoleei, i jest dopuszczalne powtarzanie
animals = pd.Series(['cat', 'dog', 'bird', 'panda', 'snake'], index=[0,2,4,1,4])
animals

0      cat
2      dog
4     bird
1    panda
4    snake
dtype: object

In [29]:
# odczyt spod indexów [4]
animals.loc[4]

4     bird
4    snake
dtype: object

In [30]:
# wskazanie po oznaczeniu indeksu
animals.loc[1]

'panda'

In [31]:
# wskazanie po rzeczywistej pozycji od 0
animals.iloc[1]

'dog'

In [32]:
# odczyt dwóch pierwszych pozycji, po rzeczywistej pozycji
animals.iloc[:2]

0    cat
2    dog
dtype: object

In [34]:
# odczyt od rzeczywistej pozycji 1 do 4, zbiór na końcu otwarty czyli w zapisie matematycznym <1,4)
animals.iloc[1:4]

2      dog
4     bird
1    panda
dtype: object

## Dostęp do komórek

In [19]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [20]:
car_sales['Doors'][2]

3

In [22]:
# kilka początkowych komórek w celu podglądu, np. jak tablica ma 10000 wierszy
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [24]:
# wycinek o określonej długości
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00